#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2024/10/22 17:24
# @Author  : yuxj
# @File    : prompt_config.py
# 最终输出抽取至多 {max_knowledge_triplets} 行
KG_TRIPLET_EXTRACT_TMPL = """
根据给定的文本，通过一步一步总结，理解，最终输出抽取(主语, 谓语, 宾语) 格式的三元组用作构建问答知识图谱，忽略文本中的停止符号。
<注意> 返回多个主谓宾格式数据，但是保证抽取的(主语, 谓语, 宾语)数据的必须是正确的。
<注意> 保证三元组只有主谓宾三部分，不要把罗列的知识放在一行中，而应该拆为多行知识。
<注意> 如果文本是大段代码或者命令行、罗列的步骤，先总结出知识再抽取有意义的知识。
<注意> 返回格式为每一行用括号包裹,每个三元组要用逗号隔开，没有序号。
<注意> 仔细检查，只抽取有意义的知识，没有的时候返回空。
<注意> 谓语要翻译成中文。
<注意> 要注意三元组主语的选择，要明确，准确。

下面是几个例子:
---------------------
文本: 狗是人类最早驯化的动物，大约在一万四千年前，人类就开始驯化狼，最终演化成了我们现在看到的各种犬种。狗属于哺乳动物，其视觉、听觉和嗅觉都非常灵敏。它们是社会性的动物，通常在群体中生活。狗的寿命一般在10到15年之间，但也有一些犬种可以活到20年以上。它们的食物主要是肉类，但是也能吃一些蔬菜和谷物。
主谓宾三元组:
(狗, 是, 人类最早驯化的动物)
(狗, 属于, 哺乳动物)
(狗, 寿命为, 10到15年之间)
----
# 本例中只抽取不超过 5 行三元组，且将列表信息综合处理。
文本: Docker 的安装
Docker 是一个开源的商业产品，有两个版本：社区版（Community Edition，缩写为 CE）和企业版（Enterprise Edition，缩写为 EE）。企业版包含了一些收费服务，个人开发者一般用不到。下面的介绍都针对社区版。

Docker CE 的安装请参考官方文档，并且支持：

- Mac
- Windows
- Ubuntu
- Debian
- CentOS
- Fedora

对于其他 Linux 发行版
安装完成后，运行下面的命令，验证是否安装成功。


$ docker version
# 或者
$ docker info
Docker 需要用户具有 sudo 权限，为了避免每次命令都输入sudo，可以把用户加入 Docker 用户组（官方文档）。


$ sudo usermod -aG docker $USER
Docker 是服务器----客户端架构。命令行运行docker命令的时候，需要本机有 Docker 服务。如果这项服务没有启动，可以用下面的命令启动（官方文档）。


# service 命令的用法
$ sudo service docker start

# systemctl 命令的用法
$ sudo systemctl start docker
主谓宾三元组:
(Docker, 是, 开源的商业产品)
(Docker CE, 支持, Mac、Windows 和 Linux)
(Docker, 包含, 一些收费服务)
(Docker, 需要, 用户具有sudo权限)
(Docker, 是, 服务器-客户端架构)
---------------------

下面请根据之前的要求和例子，开始知识抽取任务！
---------------------
文本: {}


主谓宾三元组:
"""

QUERY_KEYWORD_EXTRACT_TEMPLATE_TMPL = (
    "根据下列要求完成任务，不要忘记 <注意> 的要求\n"
    "根据给定的文本，抽取多个正确实体名词关键词，"
    "这些关键词是作为适合在知识图谱中进行查询的实体。忽略文本中的停止符号。\n"
    "<注意> 保证实体名词的正确性,不要因为数量而抽取不正确的实体关键词\n"
    "<注意> 只返回要求正确的实体名次，不要一些不确定的，错误的，有歧义的，然后英文逗号隔开的格式，不带序号、换行。\n"
    "---------------------\n"
    "{}\n"
    "---------------------\n"
    "现在返回其中可能得关键词，以这样的格式 --> '张伟, 中电金信有限公司, 狗'\n"
)