import React from 'react';
import { Typography, Card } from 'antd';
import ReactMarkdown from 'react-markdown';

const { Title } = Typography;

const privacyPolicyContent = `
# 用户数据隐私政策
《小鲸智能助手隐私政策》（以下称“本政策”）适用于中电金信软件有限公司有限公司及其关联公司（以下简称“我们”或“中电金信”）推出的小鲸智能助手人工智能服务（以下简称“小鲸智能助手”或“本服务”）。

除非本隐私政策另有说明，本隐私政策适用于我们提供的智能助手网页以及随着技术发展出现的创新形态方式提供的产品和服务。如您使用我们或关联公司向您提供的小鲸智能助手的某项或某几项服务，有其单独的隐私政策的，则相应服务或产品适用相应隐私政策；如未设立单独隐私政策的，则本政策同样适用于该部分产品或服务。

请您知悉，终端用户访问开发者使用我们的开放平台服务开发的下游系统或应用时，其被收集的个人信息的处理规则不在本隐私政策的说明范围内，运营该应用的开发者作为该个人信息处理活动的处理者应当向终端用户披露相关个人信息保护规则。

当您使用或开启相关功能或使用服务时，为实现功能、服务所必需，我们会收集、使用相关信息。除非是为实现业务功能或根据法律法规要求所必需的必要信息，您均可以拒绝提供且不影响其他功能或服务。我们将在隐私政策中逐项说明所要收集的信息。

下文将帮您详细了解我们如何收集、使用、存储、转移（如适用）与保护个人信息；帮您了解查询、复制、删除、更正、撤回授权个人信息的方式。本政策与您使用我们的服务关系密切，我们建议您仔细阅读并理解本政策全部内容，作出您认为适当的选择，有关您个人信息权益的条款重要内容我们已用加粗形式提示，请特别关注。

---
一、我们如何收集和使用您的个人信息

二、我们如何使用cookie等同类技术

三、我们如何委托处理、共享、转让、公开披露您的个人信息

四、我们如何保护您的个人信息

五、我们如何存储您的个人信息

六、您如何实现管理您个人信息的权利

七、我们如何更新本政策

八、如何联系我们

---

## 一、我们如何收集和使用您的个人信息
中电金信作为个人信息的处理者，会遵循合法、正当、必要和诚信的原则，出于如下所述的目的收集和使用您的个人信息。
1. 账号注册、登录、认证
为保障您的个人空间使用安全，您需要注册并登录后方可正常使用相关服务。您在注册和登录时需要向我们提供您本人的手机号码、邮箱并设置登录密码，并且通过输入验证码，以便我们对您的用户身份进行核验。手机号码是履行国家法律法规关于网络实名制要求的必要信息，如果您不提供手机号码用于注册、登录，我们可能无法为您提供生成式人工智能技术服务。
2. 智能对话
在您使用智能对话功能服务时，我们将收集您与小鲸智能助手进行交互过程中所输入的内容（包括文本、图片、文件），我们会对上述信息进行分析与计算，以便于更好地理解您的问题和上下文语境，从而为您提供更具有相关性的信息内容，以提供智能对话服务。
当您使用搜索服务时，我们会自动接收您主动输入的信息，以便向您自动提供实时搜索结果。
在对话过程中，您可以对小鲸智能助手所输出的内容进行反馈评价。我们将收集您的反馈信息，包括您主动提交的内容，以便不断改进小鲸智能助手的输出内容质量。如您拒绝我们收集和处理前述个人信息，请您谨慎输入前述信息，但因此您可能会影响您正常使用小鲸智能助手提供的部分或全部功能。
为向您提供连续、高质量的服务，我们可能会将服务所收集的输入内容及对应输出的内容，用于小鲸智能助手服务质量的提升和优化。如您拒绝我们按照上述方式处理您的个人信息，可以通过本政策第九章的方式向我们反馈。
3. 意见反馈
如您使用意见反馈功能服务时，我们会收集您的问题描述信息、证明材料附件、手机号码、邮箱、联系人姓名，以了解您反馈的内容和需求。此类信息属于意见反馈功能服务的必要信息。为了核实您的身份，明确您的需求和相关问题的处理方案，或帮助您解决其他问题，我们可能会使用您的手机号码或邮箱。为了向您提供与您使用过程信息相关的意见反馈服务时，我们将会查询您的使用信息，包括对话记录、点赞记录、问题反馈记录。
如您直接通过本政策第八章所述的方式与我们联系，提出意见反馈，进行投诉、申诉或咨询小鲸智能助手的相关问题时，为了确保您的账号与系统的安全，您需要向我们提供您的账号信息，以便我们对您的用户身份进行核验，此类信息属于用户反馈中进行身份核验的必要信息。在反馈、投诉或咨询过程中，为了帮助您解决问题或记录相关问题的处理方案及结果，您可能需要向我们提供相应的证明材料附件，系统可能会记录您与我们之间的沟通记录，以便能够更好地帮您解决所咨询的问题和改善服务质量。如您不提供上述信息，我们可能无法向您及时反馈咨询的结果，但不影响您正常使用小鲸智能助手或服务。
4. 运营与安全保障
为了保障您的账号安全和更好地为您提供优质的服务，我们会自动收集您在使用小鲸智能助手服务过程中产生的如下信息作为网络日志：
为了保障软件与服务的安全运行、运营的质量及效率，我们会收集您的操作系统版本号、IP 地址、网络接入方式、类型、状态、网络质量数据、操作、使用、服务日志。
为了预防恶意程序、保障运营质量及效率，我们可能会收集正在运行的进程信息、页面的总体运行、使用情况与频率、页面崩溃情况、总体使用情况、性能数据。为了判断账户安全、进行身份验证、识别违法违规情况、检测及防范安全事件，并依法采取必要的记录、分析、处置措施，我们可能使用您的账户信息、设备信息以及服务日志信息。
我们可能会使用上述网络日志信息以便我们统计小鲸智能助手的使用情况，进行问题排查，并通过数据统计进行运营分析、改进和优化产品交互体验。
5. 收集、使用个人信息的其他规则
请您了解，随着我们业务的发展，可能会对功能和提供的服务有所调整变化。原则上，当新功能或服务与我们当前提供的功能或服务相关时，收集与使用的个人信息将与原处理目的具有直接或合理关联。在与原处理目的无直接或合理关联的场景下，我们收集、使用您的个人信息，会再次按照法律法规及国家标准的要求以页面提示、交互流程、协议确认方式另行向您进行告知说明，并征得您的同意。
请您理解，在下列情形中，根据法律法规及相关国家标准，我们收集和使用您的个人信息不必事先征得您的授权同意：
   1. 与我们履行法律法规规定的义务所必需的； 
   2. 与国家安全、国防安全直接相关的；
   3. 维护公共安全、公共卫生、重大公共利益所必需的； 
   4. 与刑事侦查、起诉、审判和判决执行等直接相关的； 
   5. 出于维护您或他人的生命、财产等重大合法权益所必需但又很难得到本人授权同意的； 
   6. 您自行向社会公众公开的个人信息； 
   7. 根据个人信息主体要求签订和履行合同所必需的； 
   8. 从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道； 
   9. 为开展合法的新闻报道所必需的； 
   10. 法律法规规定的其他情形；
   特别提示您注意，如信息无法单独或结合其他信息识别到您的个人身份，其不属于法律意义上您的个人信息；当您的信息可以单独或结合其他信息识别到您的个人身份时，或我们将无法与任何特定个人信息建立联系的数据与其他您的个人信息结合使用时，这些信息在结合使用期间，将作为您的个人信息按照本隐私政策处理与保护。
   
## 二、我们如何使用Cookie等同类技术
1. Cookie技术的使用
   我们会通过cookies收集和使用您的信息，并将该等信息储存为日志信息。我们使用自己的cookies，目的是用于以下用途：
   1. 记住您的身份。例如：cookies有助于我们辨认您作为我们的注册用户的身份，或保存您向我们提供的其他信息；
   2. 分析您使用我们服务的情况。例如，我们可利用cookies来了解您使用我们的服务进行什么活动； 我们为上述目的使用cookies的同时，可能将通过cookies收集的非个人身份信息，经统计加工后提供给或其他合作伙伴，用于分析用户如何使用我们的服务。 
2. Cookie的清除
   大多数浏览器均为用户提供了清除浏览器缓存数据的功能，您可以在浏览器设置功能中进行相应的数据清除操作。如您进行清除，因为这些修改，您可能无法使用依赖于cookies的服务或相应功能。

## 三、我们如何委托处理、共享、转让、公开披露您的个人信息
1. 数据共享的原则
   1. 合法原则： 与合作方合作过程中涉及数据使用活动的，必须具有合法目的、符合法定的合法性基础。如果合作方使用信息不再符合合法原则，则其不应再使用您的个人信息，或在获得相应合法性基础后再行使用。
   2. 正当与最小必要原则： 数据使用必须具有正当目的，且应以达成目的必要为限。
   3. 安全审慎原则： 我们将审慎评估合作方使用数据的目的，对这些合作方的安全保障能力进行综合评估，并要求其遵循合作法律协议。
   4. 对于委托处理个人信息的场景，我们会与受托合作方根据法律规定签署相关处理协议，并对其个人信息使用活动进行监督。
   5. 对于共同处理个人信息的场景，我们会与合作方根据法律规定签署相关协议并约定各自的权利和义务，确保在使用相关个人信息的过程中遵守法律的相关规定、保护数据安全。
   6. 若具体功能和场景中涉及由我们的关联方、第三方提供服务，则合作方范围包括我们的关联方与第三方。
2. 实现功能或服务的数据使用
   当您使用小鲸智能助手中由我们的合作方提供的功能，或者由软件服务提供商、智能设备提供商、系统服务提供商与我们联合为您提供的服务时，我们可能会与其使用为实现业务目的所必需的信息。
3. 转移
   随着我们业务的持续发展，我们将有可能进行合并、收购、资产转让，您的个人信息有可能因此而被转移。在发生前述变更时，我们将按照法律法规及不低于本隐私政策所载明的安全标准要求继受方继续履行个人信息处理者的义务，若继受方变更原先的处理目的、处理方式的，我们将要求继受方重新征得您的授权同意。
4. 公开
   1. 我们不会公开您的个人信息，除非遵循国家法律法规规定或者获得您的同意。我们公开您的个人信息会采用符合行业内标准的安全保护措施。
   2. 在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。
   3. 如果我们确定您出现违反法律法规或严重违反本产品相关协议规则的情况，或为保护本产品及其关联公司用户或公众的人身财产安全免遭侵害，我们可能依据法律法规或本产品相关协议规则披露关于您的个人信息，包括相关违规行为以及本产品已对您采取的措施。
5. 委托处理、共享、转让、公开披露个人信息时事先征得授权同意的例外
   以下情形中，委托处理、共享、转让、公开披露您的个人信息无需事先征得您的授权同意：
   1. 我们履行法律法规规定的义务所必需的；
   2. 与国家安全、国防安全直接相关的；
   3. 维护公共安全、公共卫生、重大公共利益所必需的；
   4. 刑事侦查、起诉、审判和判决执行等所必需的；
   5. 出于维护您或他人的生命、财产等重大合法权益所必需但又很难得到本人授权同意的；
   6. 您自行向社会公众公开的个人信息；
   7. 根据个人信息主体要求签订和履行合同所必需的；
   8. 从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；
   9. 为开展合法的新闻报道所必需的；
   10. 法律法规规定的其他情形。
   请您知悉：根据法律规定，委托处理、共享、转让及公开披露经匿名化处理的个人信息的，不属于个人信息的对外委托处理、共享、转让及公开披露的处理行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。
   
## 四、我们如何保护您的个人信息
1. 用户的隐私和个人信息保护

    我们非常重视用户的隐私和个人信息保护，也会采取合理的措施保护用户的个人信息。除法律法规规定或本政策另有约定的情形外，我们将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。未经用户许可我们不会向第三方公开、透露用户个人信息，我们会对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。

2. 数据安全措施
   1. 我们已采用符合业界标准的安全防护措施，包括建立合理的制度规范、安全技术来防止您的个人信息遭到未经授权的访问使用、修改，避免数据的损坏或丢失。
   2. 我们已采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
   3. 互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的账号安全。
      
## 五、我们如何存储您的个人信息
1. 存储信息的地点

    小鲸智能助手遵守法律法规的规定，收集的有关您的信息和资料将保存在中华人民共和国境内大陆地区小鲸智能助手的服务器上。以下情形除外：
   * 法律法规有明确规定；
   * 获得您的明确授权；
   * 您通过互联网进行跨境交易等个人主动行为。 

2. 存储信息的期限 
* 我们仅在为提供小鲸智能助手服务之目的所必需的期间内保留您的个人信息。 
* 如果您注销账号、主动删除个人信息或超出必要的期限后，我们将对您的个人信息进行删除或匿名化处理，但以下情况除外： 
* 遵从法律法规有关信息留存的要求（例如：《网络安全法》规定：采取监测、记录网络运行状态、网络安全事件的技术措施，并按照规定留存相关的网络日志不少于六个月）。 
* 出于财务、审计、争议解决等目的需要合理延长期限的。 
* 当本服务发生停止运营的情形时，小鲸智能助手将采取包括发送通知和公告形式通知您，并在法律法规要求的期限内删除服务器中留存的您的个人信息。

## 六、您如何实现管理您个人信息的权利
1. 您的个人信息权利
    按照中国相关的法律、法规、标准，您在个人信息处理活动中享有若干权利，具体包括：
   * 您对个人信息处理享有知情权、决定权，有权限制或者拒绝他人对您个人信息进行处理，法律、行政法规另有规定的除外；
   * 您有权向个人信息处理者查阅、复制您的个人信息，法律另有规定情形的除外； 
   * 您发现您的个人信息不准确或不完整的，有权请求个人信息处理者更正、补充； 
   * 您有权请求删除您的个人信息； 
   * 您有权要求个人信息处理者对其个人信息处理规则进行解释说明。

2. 行使权利的方式 
  我们保障您对自己的个人信息行使前述权利，并为您提供相关操作路径，具体地，您可以参考以下步骤进行相关操作：
   1. 查阅、复制、更正、补充、删除您的个人信息
         您可以通过如下方式查阅、复制、更正、补充或删除您的个人信息：
         1. 查阅/更正/补充账号信息：点击头像账号区域，进行操作
         2. 查阅/删除历史对话：展开对话框左侧--选择历史对话--删除，或点击头像账号区域--选择删除所有对话
   2. 注销账号
         您有权注销您的账号，您可以根据本政策第十章所述的方式联系我们进行账号注销。在您注销账号前，我们将验证您的个人身份、安全状态、财产结清情况、设备信息等。我们将会在收到您的申请后及时进行处理，并在十五个工作日或法律法规要求的时限内回复您的请求。您知悉并理解，注销账号的行为是不可逆的行为，当您注销账号后，我们将删除有关您的相关信息或进行匿名化处理，但法律法规及相关国家标准另有规定的除外。

## 七、我们如何更新本政策
1. 为给您提供更好的服务，小鲸智能助手将不时更新与变化，我们会适时对本政策进行修订，这些修订构成本政策的一部分。
2. 本政策更新后，我们会在小鲸智能助手网站发出更新版本，通过新版本公告等方式再次提醒您阅读更新后的隐私政策，以便您及时了解本政策的最新版本。如果您不同意本政策，或对本政策修改、更新的内容有异议，您可以选择停止使用本服务或者注销账号。但请您知悉，您账号注销之前、停止使用本服务之前的行为和活动仍受本政策的约束。
3. 我们鼓励您在使用我们产品与/或服务的过程中查阅本政策。

## 八、如何联系我们
如您在使用小鲸智能助手的过程中对本政策或对您的个人信息有任何疑问或建议，请通过以下联系方式与我们联系：

联系邮箱servicedesk@gientech.com

我们可能需要您提交身份证明、有效联系方式和书面请求及相关证据，我们会在验证您的身份后处理您的请求。我们将尽快审核所涉问题，并在验证您的用户身份后的十五个工作日内回复。

`;

const Legal: React.FC = () => {
  return (
    <div className="h-screen overflow-y-auto bg-gray-50">
      <div className="py-12 px-4 sm:px-6 lg:px-8">
        <div className="max-w-4xl mx-auto">
          <Card className="shadow-sm border-0">
            <article className="prose prose-slate max-w-none">
              <ReactMarkdown>{privacyPolicyContent}</ReactMarkdown>
            </article>
          </Card>
        </div>
      </div>
    </div>
  );
};

export default Legal;
